const questions = [
    {
        question: 'Python ненің мысалы бола алады?',
        answers: [
            'A. Табиғи тілдің',
            'B. Машиналық тілдің',
            'C. Жасанды интелекттің',
            'D. Жоғары деңгейлі бағдарламалау тілінің'
        ],
        correct: 3
    },
    {
        question: 'Белгілі командалардың толық жиынтығы не деп аталады?',
        answers: [
            'A. Командалар тізімі',
            'B. Машиналық тізім',
            'C. Төмен деңгейлі тізім',
            'D. Белгілі командалар тізімі'
        ],
        correct: 0
    },
    {
        question: 'Бастапқы код дегеніміз не?',
        answers: [
            'A. Басында жазылатын код',
            'B. Компьютерлер орындайтын машина коды',
            'C. Жоғары деңгейлі бағдарламалау тілінде жазылған бағдарлама',
            'D. Бастапқы кодқа арналған басқа ат'
        ],
        correct: 2
    },
    {
        question: 'Қандай компьютерлік бағдарлама бағдарламалау тілінде жазылған нұсқауларды тікелей орындайды?',
        answers: [
            'A. Интерпретатор',
            'B. Компилятор',
            'C. Аудармашы',
            'D. Қолданбалы'
        ],
        correct: 0
    },
    {
        question: 'Осы курста Python-ның қай нұсқасы қарастырылады?',
        answers: [
            'A. Python 2',
            'B. Python 1',
            'C. Кез-келген',
            'D. Python 3'
        ],
        correct: 3
    },
    {
        question: 'CPython деген не?',
        answers: [
            'A. Python бағдарламалау тілінің әдепкі орындалуы',
            'B. Бұл Python бағдарламалау тілінің жоғарғы жиыны болып табылатын Python тілінің басқа атауы',
            'C. Жоғарғы деңгейлі бағдарламалау функцияларын орындау үшін қолданылатын құрастырылған тіл',
            'D. Бұл Python бағдарламалау тілінің жоғарғы жиыны болып табылатын Cython тілінің басқа атауы'
        ],
        correct: 0
    },
    {
        question: 'IDLE деген не?',
        answers: [
            'A. Бұл аббревиатура "Interactive Development and Learning Extension" дегенді білдіреді',
            'B. Бұл Python үшін интеграцияланған даму және оқыту ортасын білдіретін аббревиатура',
            'C. Бұл Python нұсқасы',
            'D. Бұл Cython нұсқасы'
        ],
        correct: 1
    },
    {
        question: 'Python бағдарламалау тілі өз атауын қалай алды?',
        answers: [
            'A. Гидо ван Россум оны 1970 жылдары танымал BBC комедиялық сериясы Монти Питонның ұшатын циркінің құрметіне атады',
            'B. Гидо ван Россум оны үлкен, улы емес жыландардың Pythonidae тұқымдасының құрметіне атады',
            'C. Гидо ван Россум оған Александр Македонский заманындағы драматургиялық ақын Питон Катананың есімін берді.',
            'D. Питон деген жыланның құрметіне атады'
        ],
        correct: 0
    },
    {
        question: 'Төмендегілердің қайсысы Python файл кеңейтімінің мысалы болып табылады?',
        answers: [
            'A. Pi',
            'B. Po',
            'C. P',
            'D. Py'
        ],
        correct: 3
    },
    {
        question: 'Қандай құрал сізге кодты кезең-кезеңімен іске қосуға және оны орындаудың әр сәтінде тексеруге мүмкіндік береді?',
        answers: [
            'A. Консоль',
            'B. Редактор',
            'C. Дебаггер',
            'D. IDLE'
        ],
        correct: 2
    },
    // {
    //     question: 'CPython деген не?',
    //     answers: [
    //         'A. Бұл Python бағдарламалау тілінің жоғарғы жиыны болып табылатын Python тілінің басқа атауы',
    //         'B. Python бағдарламалау тілінің әдепкі орындалуы',
    //         'C. Бұл Python бағдарламалау тілінің жоғарғы жиыны болып табылатын Cython тілінің басқа атауы',
    //         'D. Жоғары деңгейлі бағдарламалау функцияларын орындау үшін қолданылатын құрастырылған тіл'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Кто является основателем буддизма?',
    //     answers: [
    //         'A. Сиддхартха Гаутама',
    //         'B. Иисус Христос',
    //         'C. Рам Мохан Рой',
    //         'D. Лао-цзы'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какие из перечисленных народов отмечают в «День мертвых» традицию чтения своих усопших предков?',
    //     answers: [
    //         'A. Индейцы Амазонки',
    //         'B. Китайцы',
    //         'C. Мексиканцы',
    //         'D. Греки'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Какая религия является самой распространенной в мире?',
    //     answers: [
    //         'A. Христианство',
    //         'B. Иудаизм',
    //         'C. Буддизм',
    //         'D. Ислам'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какая этическая концепция подчеркивает важность взаимопомощи и солидарности в обществе?',
    //     answers: [
    //         'A. Кодекс Рыцаря',
    //         'B. Анархизм',
    //         'C. Хедонизм',
    //         'D. Конфуцианство'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Какая из следующих религий практикует веру в многих богов?',
    //     answers: [
    //         'A. Даосизм',
    //         'B. Иудаизм',
    //         'C. Синтоизм',
    //         'D. Зороастризм'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Какой философ формулировал категорический императив в этике?',
    //     answers: [
    //         'A. Иммануил Кант',
    //         'B. Фридрих Ницше',
    //         'C. Карл Маркс',
    //         'D. Давид Юм'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какой термин описывает иудейское этическое наставление, содержащее Десять Заповедей?',
    //     answers: [
    //         'A. Библия',
    //         'B. Талмуд',
    //         'C. Каббала',
    //         'D. Тора'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Кто известен как «отец современной физики» и разработал «закон взаимосвязи массы и энергии»?',
    //     answers: [
    //         'A. Исаак Ньютон',
    //         'B. Нильс Бор',
    //         'C. Стивен Хокинг',
    //         'D. Альберт Эйнштейн'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Кто написал философское сочинение «Искусство войны», изучаемое как искусство управления?',
    //     answers: [
    //         'A. Сунь Цзы',
    //         'B. Гомер',
    //         'C. Хомер Симпсон',
    //         'D. Конфуций'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какая из следующих религий имеет священное писание под названием «Бхагавад-гита»?',
    //     answers: [
    //         'A. Иудаизм',
    //         'B. Христианство',
    //         'C. Буддизм',
    //         'D. Индуизм'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Какая религия практикует священный обряд «крещение»?',
    //     answers: [
    //         'A. Христианство',
    //         'B. Иудаизм',
    //         'C. Буддизм',
    //         'D. Ислам'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Кто был советником Тауке хана и одним из соавторов свода законов «Жеті жарғы»?',
    //     answers: [
    //         'A. Амангельды Иманов',
    //         'B. Айтеке би',
    //         'C. Каныш Сатпаев',
    //         'D. Курмангазы Сагырбайулы'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Какое великое имя из мира музыки открыло новые горизонты в композиции и считается одним из самых влиятельных композиторов всех времен?',
    //     answers: [
    //         'A. Вольфганг Амадей Моцарт',
    //         'B. Людвиг ван Бетховен',
    //         'C. Йоханн Себастьян Бах',
    //         'D. Густав Малер'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Какой философ предложил идеи о «социальном договоре» и «естественных правах»?',
    //     answers: [
    //         'A. Карл Маркс',
    //         'B. Сёрен Кьеркегор',
    //         'C. Жан-Жак Руссо',
    //         'D. Фридрих Ницше'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Какое здание в Нью-Йорке служило самым высоким в мире с 1931 по 1970 год?',
    //     answers: [
    //         'A. Биг-Бен (Башня Елизаветы)',
    //         'B. Всемирный торговый центр (Башни-близнецы)',
    //         'C. Эмпайр-стейт-билдинг',
    //         'D. Гранд-Каньон'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Автор книги «Божественная комедия»',
    //     answers: [
    //         'A. Франсуа Рабле',
    //         'B. Данте Алигьери',
    //         'C. Леонардо да Винчи',
    //         'D. Уильям Шекспир'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Какое великое имя в мире литературы создало «Анну Каренину»?',
    //     answers: [
    //         'A. Лев Толстой',
    //         'B. Уильям Шекспир',
    //         'C. Александр Пушкин',
    //         'D. Братья Гримм'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какой город является священным для иудаизма?',
    //     answers: [
    //         'A. Мекка',
    //         'B. Иерусалим',
    //         'C. Ватикан',
    //         'D. Бенарес'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Какое из нижеперечисленных племен в Африке известно своими длинными шеями и использованием колье?',
    //     answers: [
    //         'A. Маори',
    //         'B. Индейцы племени Чероки',
    //         'C. Племя Масаи',
    //         'D. Индейцы племени Амазонки'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Какому ученому удалось получить Нобелевскую премию дважды?',
    //     answers: [
    //         'A. Мария Склодовская-Кюри',
    //         'B. Альберт Эйнштейн',
    //         'C. Никола Тесла',
    //         'D. Чарльз Дарвин'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Кто создал знаменитую скульптуру «Давид»?',
    //     answers: [
    //         'A. Леонардо да Винчи',
    //         'B. Рафаэль',
    //         'C. Микеланджело',
    //         'D. Винченцо Фоппа'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Какой ученый открыл закон сохранения массы в химии?',
    //     answers: [
    //         'A. Мария Кюри',
    //         'B. Альберт Эйнштейн',
    //         'C. Нильс Бор',
    //         'D. Михаил Ломоносов'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Какой художник создал знаменитую картину «Звёздная ночь»?',
    //     answers: [
    //         'A. Пабло Пикассо',
    //         'B. Винсент Ван Гог',
    //         'C. Леонардо да Винчи',
    //         'D. Эдвард Мунк'
    //     ],
    //     correct: 1
    // },
];

export default questions;