const questions = [
    {
        question: 'Дұрыс тұжырымды таңдаңыз',
        answers: [
            'A. Python 3 пен Python 2 кері үйлесімді болып табылады',
            'B. Python тқмен деңгейлі бағдарламалау үшін жақсы таңдау болып табылады',
            'C. Python қолданбалар үшін сынақтарды жасау және іске қосу үшін жаман таңдау болып табылады',
            'D. Python тегін, ашық бастапқы коды және көп платформалы'
        ],
        correct: 3
    },
    {
        question: 'Компиляцияға қатысты қандай мәлімдеме дұрыс?',
        answers: [
            'A. Компилятор әдетте интерпретаторға қарағанда жылдамырақ',
            'B. Компилятор әдетте интерпретаторға қарағанда баяулау',
            'C. Сізде де, соңғы пайдаланушыда да кодты іске қосу үшін компилятор болуы керек',
            'D. Код машиналық кодқа түрлендірілмейді'
        ],
        correct: 0
    },
    {
        question: 'ОЖ-мен өзара әрекеттесуге және Python пәрмендері мен сценарийлерін орындауға мүмкіндік беретін пәрмен жолы интерпретаторы дегеніміз не?',
        answers: [
            'A. Редактор',
            'B. Jython',
            'C. Консоль',
            'D. Компилятор'
        ],
        correct: 2
    },
    {
        question: 'Скрипт үшін қай анықтама дұрыс болып келеді?',
        answers: [
            'A. Бұл Python бағдарламасын құрайтын нұсқауларды қамтитын мәтіндік файл',
            'B. Бұл интерпретатор жасаған қате туралы хабар',
            'C. Бұл компилятор жасаған қате туралы хабар',
            'D. Бұл нөлдер мен бірліктердің тізбегінен тұратын мәтіндік файл'
        ],
        correct: 0
    },
    {
        question: 'Құрамында жоғары деңгейлі бағдарламалау тілінде жазылған программа бар бағдарлама қалай аталады?',
        answers: [
            'A. Машина файлы',
            'B. Мақсатты файл',
            'C. Код файлы',
            'D. Түпнұсқа файлы'
        ],
        correct: 3
    },
    {
        question: 'Машина коды дегеніміз не?',
        answers: [
            'A. Компьютер оқитын және түсінетін цифрлық биттерден тұратын төмен деңгейлі бағдарламалау тілі',
            'B. Жоғары деңгейлі тілдің нұсқауларын құрайтын он алтылық сандардан тұратын төменгі деңгейлі бағдарламалау тілі',
            'C. Компьютерлік процессорға арналған ассемблер кодынан тұратын орта деңгейдегі бағдарламалау тілі',
            'D. Адамдар оқи алатын және түсіне алатын нұсқаулар тізімінен тұратын жоғары деңгейлі бағдарламалау тілі'
        ],
        correct: 0
    },
    {
        question: 'Келесі бағдарламаның күтілетін әрекеті қандай? print("Goodbye!")',
        answers: [
            'A. Бағдарлама экранға келесі жолды шығарады: Goodbye!',
            'B. Бағдарлама экранда қате туралы хабарды көрсетеді',
            'C. Бағдарлама экранға келесі жолды шығарады: ("Goodbye!")',
            'D. Бағдарлама экранға келесі жолды шығарады: "Goodbye!"'
        ],
        correct: 1
    },
    {
        question: 'Тілді құрайтын негізгі төрт элемент қандай?',
        answers: [
            'A. Алфавит,  лексика, синтаксис және семантика',
            'B. Алфавит,  фонетика, фонология және семантика',
            'C. Алфавит,  лексика, фонетика және семантика',
            'D. Алфавит,  фонетика, морфология және семантика'
        ],
        correct: 0
    },
    // {
    //     question: 'Какой термин описывает концепцию морального и этического поведения в исламе?',
    //     answers: [
    //         'A. Легализм',
    //         'B. Абсолютизм',
    //         'C. Феодализм',
    //         'D. Шариат'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Какой народ практикует традицию «медитации» для духовного развития?',
    //     answers: [
    //         'A. Индейцы Амазонки',
    //         'B. Греки',
    //         'C. Тибетцы',
    //         'D. Майя'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Какой термин используется для описания техники изготовления керамических изделий, при которой обожженная глина покрывается расписной глазурью?',
    //     answers: [
    //         'A. Фаянс',
    //         'B. Майолика',
    //         'C. Терракота',
    //         'D. Порцелян'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Кто является основателем буддизма?',
    //     answers: [
    //         'A. Сиддхартха Гаутама',
    //         'B. Иисус Христос',
    //         'C. Рам Мохан Рой',
    //         'D. Лао-цзы'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какие из перечисленных народов отмечают в «День мертвых» традицию чтения своих усопших предков?',
    //     answers: [
    //         'A. Индейцы Амазонки',
    //         'B. Китайцы',
    //         'C. Мексиканцы',
    //         'D. Греки'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Какая религия является самой распространенной в мире?',
    //     answers: [
    //         'A. Христианство',
    //         'B. Иудаизм',
    //         'C. Буддизм',
    //         'D. Ислам'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какая этическая концепция подчеркивает важность взаимопомощи и солидарности в обществе?',
    //     answers: [
    //         'A. Кодекс Рыцаря',
    //         'B. Анархизм',
    //         'C. Хедонизм',
    //         'D. Конфуцианство'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Какая из следующих религий практикует веру в многих богов?',
    //     answers: [
    //         'A. Даосизм',
    //         'B. Иудаизм',
    //         'C. Синтоизм',
    //         'D. Зороастризм'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Какой философ формулировал категорический императив в этике?',
    //     answers: [
    //         'A. Иммануил Кант',
    //         'B. Фридрих Ницше',
    //         'C. Карл Маркс',
    //         'D. Давид Юм'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какой термин описывает иудейское этическое наставление, содержащее Десять Заповедей?',
    //     answers: [
    //         'A. Библия',
    //         'B. Талмуд',
    //         'C. Каббала',
    //         'D. Тора'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Кто известен как «отец современной физики» и разработал «закон взаимосвязи массы и энергии»?',
    //     answers: [
    //         'A. Исаак Ньютон',
    //         'B. Нильс Бор',
    //         'C. Стивен Хокинг',
    //         'D. Альберт Эйнштейн'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Кто написал философское сочинение «Искусство войны», изучаемое как искусство управления?',
    //     answers: [
    //         'A. Сунь Цзы',
    //         'B. Гомер',
    //         'C. Хомер Симпсон',
    //         'D. Конфуций'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какая из следующих религий имеет священное писание под названием «Бхагавад-гита»?',
    //     answers: [
    //         'A. Иудаизм',
    //         'B. Христианство',
    //         'C. Буддизм',
    //         'D. Индуизм'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Какая религия практикует священный обряд «крещение»?',
    //     answers: [
    //         'A. Христианство',
    //         'B. Иудаизм',
    //         'C. Буддизм',
    //         'D. Ислам'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Кто был советником Тауке хана и одним из соавторов свода законов «Жеті жарғы»?',
    //     answers: [
    //         'A. Амангельды Иманов',
    //         'B. Айтеке би',
    //         'C. Каныш Сатпаев',
    //         'D. Курмангазы Сагырбайулы'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Какое великое имя из мира музыки открыло новые горизонты в композиции и считается одним из самых влиятельных композиторов всех времен?',
    //     answers: [
    //         'A. Вольфганг Амадей Моцарт',
    //         'B. Людвиг ван Бетховен',
    //         'C. Йоханн Себастьян Бах',
    //         'D. Густав Малер'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Какой философ предложил идеи о «социальном договоре» и «естественных правах»?',
    //     answers: [
    //         'A. Карл Маркс',
    //         'B. Сёрен Кьеркегор',
    //         'C. Жан-Жак Руссо',
    //         'D. Фридрих Ницше'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Какое здание в Нью-Йорке служило самым высоким в мире с 1931 по 1970 год?',
    //     answers: [
    //         'A. Биг-Бен (Башня Елизаветы)',
    //         'B. Всемирный торговый центр (Башни-близнецы)',
    //         'C. Эмпайр-стейт-билдинг',
    //         'D. Гранд-Каньон'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Автор книги «Божественная комедия»',
    //     answers: [
    //         'A. Франсуа Рабле',
    //         'B. Данте Алигьери',
    //         'C. Леонардо да Винчи',
    //         'D. Уильям Шекспир'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Какое великое имя в мире литературы создало «Анну Каренину»?',
    //     answers: [
    //         'A. Лев Толстой',
    //         'B. Уильям Шекспир',
    //         'C. Александр Пушкин',
    //         'D. Братья Гримм'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Какой город является священным для иудаизма?',
    //     answers: [
    //         'A. Мекка',
    //         'B. Иерусалим',
    //         'C. Ватикан',
    //         'D. Бенарес'
    //     ],
    //     correct: 1
    // },
    // {
    //     question: 'Какое из нижеперечисленных племен в Африке известно своими длинными шеями и использованием колье?',
    //     answers: [
    //         'A. Маори',
    //         'B. Индейцы племени Чероки',
    //         'C. Племя Масаи',
    //         'D. Индейцы племени Амазонки'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Какому ученому удалось получить Нобелевскую премию дважды?',
    //     answers: [
    //         'A. Мария Склодовская-Кюри',
    //         'B. Альберт Эйнштейн',
    //         'C. Никола Тесла',
    //         'D. Чарльз Дарвин'
    //     ],
    //     correct: 0
    // },
    // {
    //     question: 'Кто создал знаменитую скульптуру «Давид»?',
    //     answers: [
    //         'A. Леонардо да Винчи',
    //         'B. Рафаэль',
    //         'C. Микеланджело',
    //         'D. Винченцо Фоппа'
    //     ],
    //     correct: 2
    // },
    // {
    //     question: 'Какой ученый открыл закон сохранения массы в химии?',
    //     answers: [
    //         'A. Мария Кюри',
    //         'B. Альберт Эйнштейн',
    //         'C. Нильс Бор',
    //         'D. Михаил Ломоносов'
    //     ],
    //     correct: 3
    // },
    // {
    //     question: 'Какой художник создал знаменитую картину «Звёздная ночь»?',
    //     answers: [
    //         'A. Пабло Пикассо',
    //         'B. Винсент Ван Гог',
    //         'C. Леонардо да Винчи',
    //         'D. Эдвард Мунк'
    //     ],
    //     correct: 1
    // },
];

export default questions;